queens_aaa_workflow/openfoam_cases/case_003/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1;

vertices
(
    (-38.876125 -25.541737 -58.062358)
    (77.529600 -25.541737 -58.062358)
    (77.529600 154.816056 -58.062358)
    (-38.876125 154.816056 -58.062358)
    (-38.876125 -25.541737 58.062358)
    (77.529600 -25.541737 58.062358)
    (77.529600 154.816056 58.062358)
    (-38.876125 154.816056 58.062358)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (233 361 233) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    world
    {
        type patch;
        faces
        (
            (3 7 6 2)
            (0 4 7 3)
            (2 6 5 1)
            (1 5 4 0)
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);
